#
# Демо-версия для GitHub
#

import os

# Ссылки и ID администраторов

# Настройки режимов работы бота
IS_DEMO = True  
#IS_DEMO = False
# Поставьте True для рекрутеров, или False для боевого режима

if IS_DEMO: 
    #в демо-версии - адрес разработчика
    TEACHER_URL = "https://t.me/RomanSazonov"
    HELP_TEXT =  (
    "Демо-версия, команды      #\n" 
    "доступны всем пользователям!\n\n"
    "📝 Команды для администратора бота:\n\n"
    "Редактировать:\n"
        "/edit_welcome - приветствие\n"
        "/edit_about - блок 'О преподавателе'\n"
         "/edit_prices - цены\n"
         "/edit_photo - главное фото\n"
         "/edit_faq1 , /edit_faq2 , /edit_faq3 -\n"
         "ответы на частые вопросы 1, 2 и 3\n"
         "\nСбросить изменения:\n"
        "/reset_welcome - приветствие\n"
        "/reset_about - блок 'О преподавателе'\n"   
        "/reset_prices - цены\n"
         "/reset_faq1 , /reset_faq2 , /reset_faq3 -\n"
         "ответы на частые вопросы 1, 2 и 3\n\n"
        "/start - Запуск бота"
     )
else :
    TEACHER_URL = "https://t.me/lionel0ve"
    HELP_TEXT =  (
    "📝 Команды для администратора бота:\n\n"
    "Редактировать:\n"
        "/edit_welcome - приветствие\n"
        "/edit_about - блок 'О преподавателе'\n"
         "/edit_prices - цены\n"
         "/edit_photo - главное фото\n"
         "/edit_faq1 , /edit_faq2 , /edit_faq3 -\n"
         "ответы на частые вопросы 1, 2 и 3\n"
         "\nСбросить изменения:\n"
        "/reset_welcome - приветствие\n"
        "/reset_about - блок 'О преподавателе'\n"   
        "/reset_prices - цены\n"
         "/reset_faq1 , /reset_faq2 , /reset_faq3 -\n"
         "ответы на частые вопросы 1, 2 и 3\n\n"
        "/start - Запуск бота"
     )


ADMIN_IDS = {406982732, 955990821}  # Используем set для быстрого поиска

script_dir = os.path.dirname(os.path.abspath(__file__))
env_path = os.path.join(script_dir, '.env')

#токен берем из переменной окружения
BOT_TOKEN = os.getenv("TEACHER_BOT_TOKEN", "")

# Имена файлов для фото
PHOTO_FILENAME = "Lionel0ve-002.jpg"
PHOTO_FILENAME_ETALON = "Lionel0ve-001.jpg"

# Базовые тексты (для сброса и первого запуска)



ETALON_TEXTS = {

    "welcome": "👋 Привет! Меня зовут Ирина, я преподаю гитару, электрогитару и укулеле 🎸 Онлайн и оффлайн.\nСо мной ты научишься играть на инструменте и петь, перестанешь бояться сцены и сможешь впечатлить всех знакомых своим новым талантом 🤟\n",
    "prices": "💳 Цены и абонементы:\n\nОчные занятия: г.Санкт-Петербург.\n(Парнас, Петроградская, Чернышевская)\n• Пробный урок (45 минут) —1 000 ₽\n• Разовое занятие (55 минут) — 3000 ₽\n• Абонемент на 4 занятия — 10800 ₽\n (1 занятие- 2700 ₽)\n• Абонемент на 8 занятий — 20000 ₽\n(1 занятие- 2500 ₽)\n\nОнлайн занятия:\n• Пробный урок (45 минут) —1 000 ₽\n• Разовое занятие (55 минут) — 2500 ₽\n• Абонемент на 4 занятия — 8800 ₽\n(1 занятие- 2200 ₽)\n• Абонемент на 8 занятий — 16000₽\n (1 занятие- 2000 ₽)" ,
    "about": "🎸✨ Меня зовут Ирина, я дипломированный специалист🎓 (преподаватель, артист, руководитель муз.коллектива)  с опытом преподавания более 5 лет. За это время я работала в самых разных форматах и с детьми и со взрослыми учениками. Мой музыкальный путь - это не только уроки. Я выступаю на сцене, пишу свои песни и даже руководила настоящим эстрадно-джазовым оркестром! И я точно знаю: научиться играть может каждый.  🎸",    
    "faq_1": "❓ Часто задаваемые вопросы (FAQ)\n 🎸 С чего начать?\n• Нужна ли своя гитара на первое занятие? На первый пробный урок инструмент брать не обязательно — я предоставлю студийную гитару. Но для домашних тренировок своя гитара понадобится уже к следующему занятию.\n• Какую гитару купить новичку? Все зависит от ваших музыкальных предпочтений. Для классики и переборов подойдет акустика с нейлоновыми струнами, для рока и сочных аккордов — с металлическими струнами или электрогитара. Напишите мне в личные сообщения, и я скину подборку проверенных моделей под ваш бюджет.\n• Беру ли я учеников с нуля? Да, более 70% моих учеников никогда раньше не держали инструмент в руках. Мы начнем с правильной постановки рук и простых аккордов.\n",
    "faq_2": "⏳ Формат и расписание\n\n• Сколько длится одно занятие? \nПробный урок длится 45 минут.\nСтандартный урок длится 55 минут.\n• Где проходят уроки? Занятия проходят в уютной оборудованной студии (в 5 минутах от метро) либо онлайн через Teams/Telegram/ VK/ Яндекс Телемост.\nТакже могу приезжать к вам, если обеим сторонам это будет комфортно 🙌\n• Как часто нужно заниматься? Идеальный график для прогресса — 1-2 раза в неделю с преподавателем + 20 минут самостоятельных занятий дома каждый день." ,
    "faq_3": "🎵 Программа и результаты\n• Какую музыку мы будем учить? Никакой скучной классики, если вы этого сами не хотите. Мы учимся на тех песнях и риффах, которые нравятся лично вам — от Виктора Цоя и Короля и Шута до Metallica и современных поп-хитов.\n• Через сколько я сыграю первую песню? Простую песню на 3-4 аккордах (например, «Пачка сигарет» или «Батарейка») большинство учеников уверенно играют уже через 2–3 занятия.\n• Нужно ли учить ноты и сольфеджио? Не обязательно. Для быстрой игры на гитаре мы используем табы (табулатуры) и схемы аккордов - это гораздо проще и нагляднее нот. Но по запросу могу обучить и теории музыки.\nТакже могу научить вас писать свои собственные песни, вы удивитесь, насколько это просто и интересно 🎤"
   
}
